Revit 2024 API
RebarContainerItem Class
 Provides implementation for Rebar stored in RebarContainer.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class RebarContainerItem : IDisposable
Visual Basic
Public Class RebarContainerItem _
	Implements IDisposable
Visual C++
public ref class RebarContainerItem : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarContainerItem
See Also
RebarContainerItem Members
Autodesk.Revit.DB.Structure Namespace